Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyConnectorDeletedError Property
 The family Connector has been modified so the connection is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyConnectorDeletedError { get; }
Public Shared ReadOnly Property FamilyConnectorDeletedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyConnectorDeletedError {
	FailureDefinitionId^ get ();
}
static member FamilyConnectorDeletedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace